## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.kubernetes_secret.argocd_admin will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret" "argocd_admin" {
+       data      = (sensitive value)
+       id        = (known after apply)
+       immutable = (known after apply)
+       type      = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "argocd-initial-admin-secret"
+           namespace        = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # helm_release.argocd will be updated in-place
!   resource "helm_release" "argocd" {
        id                         = "argocd"
        name                       = "argocd"
!       values                     = [
            (sensitive),
+           <<-EOT
                "server":
                  "rbacConfig": |
                    "policy.csv":
-                     "p, autotune@contrasting.org, role:admin"
-                     "policy.default": ""
                      "scopes": "[email, group]"
            EOT,
        ]
!       version                    = "5.0.0" -> "5.1.0"
        # (26 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
